In [1]:
import pandas as pd

## 예제 5-6 피봇을 이용한 재구조화

In [2]:
df = pd.DataFrame({'foo': ['one','one','one','two','two','two'],
                           'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                           'baz': [1, 2, 3, 4, 5, 6]})

In [3]:
df

  bar  baz  foo
0   A    1  one
1   B    2  one
2   C    3  one
3   A    4  two
4   B    5  two
5   C    6  two

In [4]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [5]:
df1 = pd.DataFrame({'foo': ['one','one','one','two','two','two'],
                           'bar': ['A', 'B', 'A', 'A', 'B', 'C'],
                           'baz': [1, 2, 3, 4, 5, 6]})

In [6]:
try : 
    df1.pivot('foo','bar','baz')
except Exception as e :
    print(e)

Index contains duplicate entries, cannot reshape

In [7]:
df1 = df1.drop_duplicates(['foo','bar'])

In [8]:
df1

  bar  baz  foo
0   A    1  one
1   B    2  one
3   A    4  two
4   B    5  two
5   C    6  two

In [9]:
df1.pivot('foo','bar','baz')

bar    A    B    C
foo
one  1.0  2.0  NaN
two  4.0  5.0  6.0

In [10]:
import seaborn as sns

In [11]:
titanic = sns.load_dataset('titanic')

In [12]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [13]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [14]:
titaic_s =  titanic.groupby('survived').mean()

In [15]:
titaic_s

,pclass,age,sibsp,parch,fare,adult_male,alone
survived,,,,,,,
0,2.531876,30.626179,0.553734,0.329690,22.117887,0.817851,0.681239
1,1.950292,28.343690,0.473684,0.464912,48.395408,0.257310,0.476608

In [16]:
titaic_s.pivot(index='pclass', columns='age', values='fare')

age       28.343690  30.626179
pclass
1.950292  48.395408        NaN
2.531876        NaN  22.117887

In [17]:
titanic_ = titanic.pivot_table(values='survived',
                               index='sex', 
                               columns='class',
                               aggfunc='sum')

In [18]:
titanic_

class   First  Second  Third
sex
female     91      70     72
male       45      17     47

In [19]:
titanic_.sum().sum()

342

In [20]:
titanic['survived'].sum()

342

In [21]:
weight = pd.read_csv('../data/weight_loss.csv',encoding='cp949')

In [22]:
weight.head()

   이름   월   주  몸무게
0  지완  1월  1주   70
1  찬준  1월  1주   60
2  지완  1월  2주   69
3  찬준  1월  2주   59
4  지완  1월  3주   69

In [23]:
week4 = weight.query('주 == "4주"')

In [24]:
week4

    이름   월   주  몸무게
6   지완  1월  4주   69
7   찬준  1월  4주   59
14  지완  2월  4주   66
15  찬준  2월  4주   56
22  지완  3월  4주   64
23  찬준  3월  4주   54
30  지완  4월  4주   62
31  찬준  4월  4주   52

In [25]:
week4.pivot(index='월', columns='이름', values="몸무게")

이름  지완  찬준
월
1월  69  59
2월  66  56
3월  64  54
4월  62  52

In [26]:
week4.pivot_table(index='월',columns='이름',values="몸무게")

이름  지완  찬준
월
1월  69  59
2월  66  56
3월  64  54
4월  62  52

## 예제 5-7 스택을 이용한 재구조화

In [27]:
week4

    이름   월   주  몸무게
6   지완  1월  4주   69
7   찬준  1월  4주   59
14  지완  2월  4주   66
15  찬준  2월  4주   56
22  지완  3월  4주   64
23  찬준  3월  4주   54
30  지완  4월  4주   62
31  찬준  4월  4주   52

In [28]:
week5 = week4.set_index(['이름','월'])

In [29]:
week5.head(2)

        주  몸무게
이름 월
지완 1월  4주   69
찬준 1월  4주   59

In [30]:
week5_st = week5.stack()

In [31]:
type(week5_st)

pandas.core.series.Series

In [32]:
week5_st.index.get_level_values(0)

Index(['지완', '지완', '찬준', '찬준', '지완', '지완', '찬준', '찬준', '지완', '지완', '찬준', '찬준',
       '지완', '지완', '찬준', '찬준'],
      dtype='object', name='이름')

In [33]:
week5_st.index.get_level_values(1)

Index(['1월', '1월', '1월', '1월', '2월', '2월', '2월', '2월', '3월', '3월', '3월', '3월',
       '4월', '4월', '4월', '4월'],
      dtype='object', name='월')

In [34]:
week5_st.index.get_level_values(2)

Index(['주', '몸무게', '주', '몸무게', '주', '몸무게', '주', '몸무게', '주', '몸무게', '주', '몸무게',
       '주', '몸무게', '주', '몸무게'],
      dtype='object')

In [35]:
week5_st.values

array(['4주', 69, '4주', 59, '4주', 66, '4주', 56, '4주', 64, '4주', 54, '4주',
       62, '4주', 52], dtype=object)

In [36]:
week5_st.head(3)

이름  월
지완  1월  주      4주
        몸무게    69
찬준  1월  주      4주
dtype: object

In [37]:
to_week5 = week5_st.to_frame()

In [38]:
to_week5.head()

            0
이름 월
지완 1월 주    4주
      몸무게  69
찬준 1월 주    4주
      몸무게  59
지완 2월 주    4주

In [39]:
to_week5.index.levels

FrozenList([['지완', '찬준'], ['1월', '2월', '3월', '4월'], ['주', '몸무게']])

In [40]:
to_week5.columns

RangeIndex(start=0, stop=1, step=1)

In [41]:
week5_un = week5.unstack()

In [42]:
week5_un.head()

     주             몸무게
월   1월  2월  3월  4월  1월  2월  3월  4월
이름
지완  4주  4주  4주  4주  69  66  64  62
찬준  4주  4주  4주  4주  59  56  54  52

In [43]:
week5_un_un = week5.unstack().unstack()

In [44]:
type(week5_un_un)

pandas.core.series.Series

In [45]:
week5_un_un.values

array(['4주', '4주', '4주', '4주', '4주', '4주', '4주', '4주', 69, 59, 66, 56, 64,
       54, 62, 52], dtype=object)

In [46]:
week5_un_un.to_frame().head()

          0
  월  이름
주 1월 지완  4주
     찬준  4주
  2월 지완  4주
     찬준  4주
  3월 지완  4주

In [47]:
week4_s = week4['몸무게']

In [48]:
week4_s.index = week5['몸무게'].index

In [49]:
week4_s.head()

이름  월
지완  1월    69
찬준  1월    59
지완  2월    66
찬준  2월    56
지완  3월    64
Name: 몸무게, dtype: int64

In [50]:
week4_s.unstack()

월   1월  2월  3월  4월
이름
지완  69  66  64  62
찬준  59  56  54  52

In [51]:
type(week4_s.unstack())

pandas.core.frame.DataFrame

In [52]:
week4_s.unstack(level=0)

이름  지완  찬준
월
1월  69  59
2월  66  56
3월  64  54
4월  62  52

In [53]:
week4_s.unstack(level=1)

월   1월  2월  3월  4월
이름
지완  69  66  64  62
찬준  59  56  54  52

## 예제 5-8  데이터를 합치기

In [2]:
import numpy as np

In [3]:
columns = np.array(['봄','여름','가을','겨울'])

In [4]:
data = np.array([['A0','A1','A2','A3'],
                 ['B0','B1','B2','B3'],
                 ['C0','C1','C2','C3'],
                 ['D0','D1','D2','D3']])

In [5]:
df1 = pd.DataFrame(data.T,columns=columns)

In [6]:
data1 = np.array([['A4','A5','A6','A7'],
                 ['B4','B5','B6','B7'],
                 ['C4','C5','C6','C7'],
                 ['D4','D5','D6','D7']])

In [7]:
df2 = pd.DataFrame(data1.T,columns=columns)

In [8]:
df_con = pd.concat([df1,df2])

In [9]:
df_con

    봄  여름  가을  겨울
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [10]:
index_r = list(range(0,8))

In [11]:
df_con.index = index_r

In [12]:
df_con

    봄  여름  가을  겨울
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [13]:
df_con1 = pd.concat([df1,df2],ignore_index=True)

In [14]:
df_con1

    봄  여름  가을  겨울
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [15]:
df_h = pd.concat([df1,df2],axis=1)

In [16]:
df_h

    봄  여름  가을  겨울   봄  여름  가을  겨울
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7

In [17]:
columns_r = ['봄', '여름', '가을', '겨울', '봄_', '여름_', '가을_', '겨울_']

In [18]:
df_h.columns = columns_r

In [19]:
df_h

    봄  여름  가을  겨울  봄_ 여름_ 가을_ 겨울_
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7

In [72]:
df_g = pd.concat([df1,df2],axis=1,ignore_index=True)

In [97]:
df_g

    0   1   2   3   4   5   6   7
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7

## 예제 5-9  데이터를 추가하기

In [20]:
df1

    봄  여름  가을  겨울
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [21]:
df11 = df1.copy()

In [22]:
df11.loc[4] = ['A4','B4','C4','D4']

In [23]:
df11

    봄  여름  가을  겨울
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [24]:
df11_a = df11.append({'봄':'A5','여름' :'B5','가을':'C5','겨울':'D5'}, 
                     ignore_index=True)

In [25]:
df11_a

    봄  여름  가을  겨울
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [26]:
df11

    봄  여름  가을  겨울
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [27]:
df2

    봄  여름  가을  겨울
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [28]:
df11.append(df2)

    봄  여름  가을  겨울
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

## 예제 5-10  데이터를 join 해서 처리하기

In [29]:
data3 = np.array([['A8','A9','A10','A11'],
                 ['B8','B9','B10','B11'],
                 ['E8','E9','E10','E11'],
                 ['F8','F9','F10','F11']])

In [30]:
columns3 = np.array(['봄','여름','춘분','추분'])

In [31]:
df3 = pd.DataFrame(data3.T,columns=columns3)

In [32]:
df3

     봄   여름   춘분   추분
0   A8   B8   E8   F8
1   A9   B9   E9   F9
2  A10  B10  E10  F10
3  A11  B11  E11  F11

In [33]:
df4 = pd.concat([df1,df3],join='inner',ignore_index=True)

In [34]:
df4

     봄   여름
0   A0   B0
1   A1   B1
2   A2   B2
3   A3   B3
4   A8   B8
5   A9   B9
6  A10  B10
7  A11  B11

In [35]:
df5 = pd.concat([df1,df3],axis=1, join='inner')

In [36]:
df5

    봄  여름  가을  겨울    봄   여름   춘분   추분
0  A0  B0  C0  D0   A8   B8   E8   F8
1  A1  B1  C1  D1   A9   B9   E9   F9
2  A2  B2  C2  D2  A10  B10  E10  F10
3  A3  B3  C3  D3  A11  B11  E11  F11

In [37]:
df6 = pd.concat([df1,df3],axis=1, join='outer')

In [38]:
df6

    봄  여름  가을  겨울    봄   여름   춘분   추분
0  A0  B0  C0  D0   A8   B8   E8   F8
1  A1  B1  C1  D1   A9   B9   E9   F9
2  A2  B2  C2  D2  A10  B10  E10  F10
3  A3  B3  C3  D3  A11  B11  E11  F11

In [41]:
pd.concat([df1,df3],axis=1, keys=['사계절'],join='inner')

  사계절
    봄  여름  가을  겨울
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [40]:
pd.concat([df1,df3],axis=1, keys=['사계절','춘추분'],join='inner')

  사계절              춘추분
    봄  여름  가을  겨울    봄   여름   춘분   추분
0  A0  B0  C0  D0   A8   B8   E8   F8
1  A1  B1  C1  D1   A9   B9   E9   F9
2  A2  B2  C2  D2  A10  B10  E10  F10
3  A3  B3  C3  D3  A11  B11  E11  F11

In [42]:
df1.join(df3,how='inner',lsuffix='_lx', rsuffix='_rx')

  봄_lx 여름_lx  가을  겨울 봄_rx 여름_rx   춘분   추분
0   A0    B0  C0  D0   A8    B8   E8   F8
1   A1    B1  C1  D1   A9    B9   E9   F9
2   A2    B2  C2  D2  A10   B10  E10  F10
3   A3    B3  C3  D3  A11   B11  E11  F11

In [43]:
df1.join(df3,how='outer',lsuffix='_lx', rsuffix='_rx')

  봄_lx 여름_lx  가을  겨울 봄_rx 여름_rx   춘분   추분
0   A0    B0  C0  D0   A8    B8   E8   F8
1   A1    B1  C1  D1   A9    B9   E9   F9
2   A2    B2  C2  D2  A10   B10  E10  F10
3   A3    B3  C3  D3  A11   B11  E11  F11

In [44]:
df1.join(df3,on='봄',how='inner',lsuffix='_lx', rsuffix='_rx')

Empty DataFrame
Columns: [봄, 봄_lx, 여름_lx, 가을, 겨울, 봄_rx, 여름_rx, 춘분, 추분]
Index: []

In [45]:
df1.join(df3,on='봄',how='outer',lsuffix='_lx', rsuffix='_rx')

    봄 봄_lx 여름_lx   가을   겨울 봄_rx 여름_rx   춘분   추분
0  A0   A0    B0   C0   D0  NaN   NaN  NaN  NaN
1  A1   A1    B1   C1   D1  NaN   NaN  NaN  NaN
2  A2   A2    B2   C2   D2  NaN   NaN  NaN  NaN
3  A3   A3    B3   C3   D3  NaN   NaN  NaN  NaN
3   0  NaN   NaN  NaN  NaN   A8    B8   E8   F8
3   1  NaN   NaN  NaN  NaN   A9    B9   E9   F9
3   2  NaN   NaN  NaN  NaN  A10   B10  E10  F10
3   3  NaN   NaN  NaN  NaN  A11   B11  E11  F11